app/controllers/abouts_controller.rb

SELECT "abouts".* FROM "abouts"
---
    def index
        @abouts = About.all

INSERT INTO "abouts" ("companyName", "invoiceApplicable", "invoiceIssueUnit", "phoneNumber", "fax", "postalCode", "headOfficeAddressCityStreet", "headOfficeAddressBuilding", "representativeName", "emailForExtension", "ccMailingList", "bccMailingList", "nameForAccountingDocs", "emailForAccountingDocs", "ccMailingListAccounting", "bccMailingListAccounting", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @about = About.new(about_params)

        if @about.save