app/controllers/contracts_controller.rb

    def index
        @contracts = Contract.all
---
SELECT "contracts".* FROM "contracts"

    def create
        @contract = Contract.new(contract_params)
        if @contract.save
---
INSERT INTO "contracts" ("woker", "contractStart", "contractEnd", "closingDate", "documentIssueDate", "companyRepresentative", "totalContractPeriod", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)