app/controllers/individuals_controller.rb

    def index
        @individuals = Individual.all
---
SELECT "individuals".* FROM "individuals"

    def create
        @individual = Individual.new(individual_params)
        if @individual.save
---
INSERT INTO "individuals" ("companyName", "contactExtension", "contactAccounting", "phoneNumber", "faxNumber", "headOfficeAddress", "contractType", "contractPrice", "minimumHours", "maximumHours", "deduction", "overtime", "settlementUnit", "paymentSite", "toporunder", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)